[
  {
    "id": "building-terminal-portfolio",
    "title": "Building a Terminal Portfolio",
    "date": "2024-01-15",
    "content": "Sometimes the best user interfaces are the ones that feel familiar. There's something magical about the command line - its simplicity, its directness, its honesty.\n\nWhen I decided to build my portfolio, I could have gone with any number of modern frameworks or flashy animations. Instead, I chose to build something that felt authentic to who I am as a developer.\n\nThe terminal interface isn't just aesthetic - it's functional. Every command does something meaningful. The games aren't just easter eggs; they're demonstrations of interactive programming. The theme system shows attention to user experience.\n\nThis blog represents the opposite philosophy - minimal, clean, focused purely on content. No distractions, no unnecessary elements. Just words and thoughts."
  },
  {
    "id": "art-of-minimal-design",
    "title": "The Art of Minimal Design",
    "date": "2024-01-10",
    "content": "Less is more. This phrase gets thrown around a lot in design circles, but what does it really mean for developers?\n\nMinimal design isn't about removing features - it's about intentionality. Every element should have a purpose. Every line of code should justify its existence.\n\nThis blog page is an exercise in that philosophy. Black text on white background. Clean typography. No social media widgets, no comment systems, no analytics tracking. Just content.\n\nSometimes the most radical thing you can do is keep it simple."
  },
  {
    "id": "code-as-craft",
    "title": "Code as Craft",
    "date": "2024-01-05",
    "content": "Programming is more than just solving problems - it's about creating experiences. Every function, every variable name, every comment is a choice that affects how someone else will interact with your work.\n\nI believe code should be readable like prose. Variable names should tell stories. Functions should have single, clear purposes. Comments should explain why, not what.\n\nWhen you write code with care, it shows. When you build interfaces with empathy, users feel it. When you craft experiences with intention, magic happens.\n\nThat's what I strive for in every project - not just working code, but code that works beautifully."
  },
  {
    "id": "welcome",
    "title": "Welcome",
    "date": "2024-01-01",
    "content": "This is my blog. A place for thoughts, ideas, and reflections on code, design, and the craft of building things on the web.\n\nYou won't find any frameworks here, no complex build systems, no tracking scripts. Just HTML, CSS, and the occasional bit of JavaScript when it serves a purpose.\n\nIf you found this through the terminal, welcome. If you stumbled here by accident, I hope you'll stay for a while.\n\nThanks for reading."
  }
]